In [1]:
import pandas as pd

In [3]:
nf=pd.read_csv("nifty.csv")

In [5]:
nf

,Date,Open,High,Low,Close,Shares Traded,Turnover (₹ Cr)
0,16-JUL-2024,24615.90,24661.25,24587.65,24613.00,283212233,28668.71
1,18-JUL-2024,24543.80,24837.75,24504.45,24800.85,350924425,40477.17
2,19-JUL-2024,24853.80,24854.80,24508.15,24530.90,343772965,33588.08
3,22-JUL-2024,24445.75,24595.20,24362.30,24509.25,324190553,32496.23
4,23-JUL-2024,24568.90,24582.55,24074.20,24479.05,436408768,44921.42
...,...,...,...,...,...,...,...
244,09-JUL-2025,25514.60,25548.70,25424.35,25476.10,239081546,20549.50
245,10-JUL-2025,25511.65,25524.05,25340.45,25355.25,219609322,21435.36
246,11-JUL-2025,25255.50,25322.45,25129.00,25149.85,249987681,26251.65
247,14-JUL-2025,25149.50,25151.10,25001.95,25082.30,259533624,23316.33
248,15-JUL-2025,25089.50,25245.20,25088.45,25195.80,241340130,23282.70

In [15]:
print(nf['Open '].dtype)

float64

In [17]:
print(nf['Date '])

0      16-JUL-2024
1      18-JUL-2024
2      19-JUL-2024
3      22-JUL-2024
4      23-JUL-2024
          ...
244    09-JUL-2025
245    10-JUL-2025
246    11-JUL-2025
247    14-JUL-2025
248    15-JUL-2025
Name: Date , Length: 249, dtype: object

In [19]:
print(nf['Date '].dtype)

object

In [29]:
df=pd.read_csv("nifty.csv")
df
filtered_df = df[df['Date '] == '16-JUL-2024']
print(filtered_df)

         Date     Open      High       Low    Close   Shares Traded   \
0  16-JUL-2024  24615.9  24661.25  24587.65  24613.0       283212233

   Turnover (₹ Cr)
0         28668.71

In [51]:
df.head(2)

,Date,Open,High,Low,Close,Shares Traded,Turnover (₹ Cr)
0,16-JUL-2024,24615.9,24661.25,24587.65,24613.00,283212233,28668.71
1,18-JUL-2024,24543.8,24837.75,24504.45,24800.85,350924425,40477.17

In [49]:
df.tail(3)

,Date,Open,High,Low,Close,Shares Traded,Turnover (₹ Cr)
246,11-JUL-2025,25255.5,25322.45,25129.00,25149.85,249987681,26251.65
247,14-JUL-2025,25149.5,25151.10,25001.95,25082.30,259533624,23316.33
248,15-JUL-2025,25089.5,25245.20,25088.45,25195.80,241340130,23282.70

In [57]:
df["Date "]

0      16-JUL-2024
1      18-JUL-2024
2      19-JUL-2024
3      22-JUL-2024
4      23-JUL-2024
          ...
244    09-JUL-2025
245    10-JUL-2025
246    11-JUL-2025
247    14-JUL-2025
248    15-JUL-2025
Name: Date , Length: 249, dtype: object

In [59]:
df["Date "][0]

'16-JUL-2024'

In [61]:
df["Open "]

0      24615.90
1      24543.80
2      24853.80
3      24445.75
4      24568.90
         ...
244    25514.60
245    25511.65
246    25255.50
247    25149.50
248    25089.50
Name: Open , Length: 249, dtype: float64

In [65]:
df["Open "][1]

24543.8

In [69]:
df["Open "].get(40000,"No Index")
#get will give you data
#no index will give you some message

'No Index'

In [75]:
df.head(2)
openSeries=df["Open " ]
openSeries[0]=999999999
openSeries
df.head(2)
#original data frame value is changed

C:\Users\shaba\AppData\Local\Temp\ipykernel_40012\2569959821.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  openSeries[0]=999999999

,Date,Open,High,Low,Close,Shares Traded,Turnover (₹ Cr)
0,16-JUL-2024,999999999.0,24661.25,24587.65,24613.00,283212233,28668.71
1,18-JUL-2024,24543.8,24837.75,24504.45,24800.85,350924425,40477.17

In [77]:
openSeries=df["Open " ].copy()
openSeries[0]=888888
openSeries
df.head(2)
#original data frame is not changed

,Date,Open,High,Low,Close,Shares Traded,Turnover (₹ Cr)
0,16-JUL-2024,999999999.0,24661.25,24587.65,24613.00,283212233,28668.71
1,18-JUL-2024,24543.8,24837.75,24504.45,24800.85,350924425,40477.17

In [79]:
df["Open "].value_counts

<bound method IndexOpsMixin.value_counts of 0      1.000000e+09
1      2.454380e+04
2      2.485380e+04
3      2.444575e+04
4      2.456890e+04
           ...
244    2.551460e+04
245    2.551165e+04
246    2.525550e+04
247    2.514950e+04
248    2.508950e+04
Name: Open , Length: 249, dtype: float64>

In [83]:
df["Close "].value_counts(sort=True, ascending=True)

Close
24613.00    1
22124.70    1
22119.30    1
22082.65    1
22337.30    1
           ..
23907.25    1
24221.90    1
24194.50    1
24213.30    1
25195.80    1
Name: count, Length: 249, dtype: int64

In [85]:
df["Close "].value_counts(normalize=True)

Close
24613.00    0.004016
23350.40    0.004016
22119.30    0.004016
22082.65    0.004016
22337.30    0.004016
              ...
23907.25    0.004016
24221.90    0.004016
24194.50    0.004016
24274.90    0.004016
25195.80    0.004016
Name: proportion, Length: 249, dtype: float64

In [97]:
def typefunc(x):
    if x == 25255.5:
        return "mammal"
    elif x == 999999999.0:
        return "mammal pokemon"
    else:
        return "not a mammal"

df["Open "].apply(typefunc)

0      mammal pokemon
1        not a mammal
2        not a mammal
3        not a mammal
4        not a mammal
            ...
244      not a mammal
245      not a mammal
246            mammal
247      not a mammal
248      not a mammal
Name: Open , Length: 249, dtype: object

In [19]:
import pandas as pd

df = pd.read_csv("nifty.csv")   # ✅ Define df first

df[['Day', 'Month', 'Year']] = df['Date '].str.split('-', expand=True)
print(df)

           Date      Open      High       Low     Close   Shares Traded   \
0    16-JUL-2024  24615.90  24661.25  24587.65  24613.00       283212233
1    18-JUL-2024  24543.80  24837.75  24504.45  24800.85       350924425
2    19-JUL-2024  24853.80  24854.80  24508.15  24530.90       343772965
3    22-JUL-2024  24445.75  24595.20  24362.30  24509.25       324190553
4    23-JUL-2024  24568.90  24582.55  24074.20  24479.05       436408768
..           ...       ...       ...       ...       ...             ...
244  09-JUL-2025  25514.60  25548.70  25424.35  25476.10       239081546
245  10-JUL-2025  25511.65  25524.05  25340.45  25355.25       219609322
246  11-JUL-2025  25255.50  25322.45  25129.00  25149.85       249987681
247  14-JUL-2025  25149.50  25151.10  25001.95  25082.30       259533624
248  15-JUL-2025  25089.50  25245.20  25088.45  25195.80       241340130

     Turnover (₹ Cr) Day Month  Year
0           28668.71  16   JUL  2024
1           40477.17  18   JUL  2024
2           33588.08  19   JUL  2024
3           32496.23  22   JUL  2024
4           44921.42  23   JUL  2024
..               ...  ..   ...   ...
244         20549.50  09   JUL  2025
245         21435.36  10   JUL  2025
246         26251.65  11   JUL  2025
247         23316.33  14   JUL  2025
248         23282.70  15   JUL  2025

[249 rows x 10 columns]

In [21]:
df = df.drop_duplicates()
print(df)

           Date      Open      High       Low     Close   Shares Traded   \
0    16-JUL-2024  24615.90  24661.25  24587.65  24613.00       283212233
1    18-JUL-2024  24543.80  24837.75  24504.45  24800.85       350924425
2    19-JUL-2024  24853.80  24854.80  24508.15  24530.90       343772965
3    22-JUL-2024  24445.75  24595.20  24362.30  24509.25       324190553
4    23-JUL-2024  24568.90  24582.55  24074.20  24479.05       436408768
..           ...       ...       ...       ...       ...             ...
244  09-JUL-2025  25514.60  25548.70  25424.35  25476.10       239081546
245  10-JUL-2025  25511.65  25524.05  25340.45  25355.25       219609322
246  11-JUL-2025  25255.50  25322.45  25129.00  25149.85       249987681
247  14-JUL-2025  25149.50  25151.10  25001.95  25082.30       259533624
248  15-JUL-2025  25089.50  25245.20  25088.45  25195.80       241340130

     Turnover (₹ Cr) Day Month  Year
0           28668.71  16   JUL  2024
1           40477.17  18   JUL  2024
2           33588.08  19   JUL  2024
3           32496.23  22   JUL  2024
4           44921.42  23   JUL  2024
..               ...  ..   ...   ...
244         20549.50  09   JUL  2025
245         21435.36  10   JUL  2025
246         26251.65  11   JUL  2025
247         23316.33  14   JUL  2025
248         23282.70  15   JUL  2025

[249 rows x 10 columns]

In [25]:
df = df.drop_duplicates(subset=['Day', 'Month', 'Year'])
print(df)

           Date      Open      High       Low     Close   Shares Traded   \
0    16-JUL-2024  24615.90  24661.25  24587.65  24613.00       283212233
1    18-JUL-2024  24543.80  24837.75  24504.45  24800.85       350924425
2    19-JUL-2024  24853.80  24854.80  24508.15  24530.90       343772965
3    22-JUL-2024  24445.75  24595.20  24362.30  24509.25       324190553
4    23-JUL-2024  24568.90  24582.55  24074.20  24479.05       436408768
..           ...       ...       ...       ...       ...             ...
244  09-JUL-2025  25514.60  25548.70  25424.35  25476.10       239081546
245  10-JUL-2025  25511.65  25524.05  25340.45  25355.25       219609322
246  11-JUL-2025  25255.50  25322.45  25129.00  25149.85       249987681
247  14-JUL-2025  25149.50  25151.10  25001.95  25082.30       259533624
248  15-JUL-2025  25089.50  25245.20  25088.45  25195.80       241340130

     Turnover (₹ Cr) Day Month  Year
0           28668.71  16   JUL  2024
1           40477.17  18   JUL  2024
2           33588.08  19   JUL  2024
3           32496.23  22   JUL  2024
4           44921.42  23   JUL  2024
..               ...  ..   ...   ...
244         20549.50  09   JUL  2025
245         21435.36  10   JUL  2025
246         26251.65  11   JUL  2025
247         23316.33  14   JUL  2025
248         23282.70  15   JUL  2025

[249 rows x 10 columns]